# RbsPipeSlopeDefParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeSlopeDefParam Property
ParameterTypeId Class See Also
---
"Pipe Slope Definitions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeSlopeDefParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeSlopeDefParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeSlopeDefParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace